In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
print(s)

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
print(s["a"])

1

In [4]:
s2 = s.reindex(['b', 'd', 'a', 'c', 'e'])
print(s2)

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [6]:
s3 = pd.Series(["blue", "yellow", "purple"], index=[0, 2, 4])
print(s3)

0      blue
2    yellow
4    purple
dtype: object

In [9]:
s4 = s3.reindex(range(6), method="ffill")
print(s4)

0      blue
1      blue
2    yellow
3    yellow
4    purple
5    purple
dtype: object

In [11]:
df = pd.DataFrame(np.arange(9).reshape(3, 3),
                 index=['a', 'b', 'c'], 
                 columns=['Tim', 'Tom', 'Kate'])
print(df)
df

   Tim  Tom  Kate
a    0    1     2
b    3    4     5
c    6    7     8

   Tim  Tom  Kate
a    0    1     2
b    3    4     5
c    6    7     8

In [12]:
df2 = df.reindex(["d", "c", "b", "a"])
df2

   Tim  Tom  Kate
d  NaN  NaN   NaN
c  6.0  7.0   8.0
b  3.0  4.0   5.0
a  0.0  1.0   2.0

In [14]:
names = ["Kate", "Tim", "Tom"]
df.reindex(columns=names)

   Kate  Tim  Tom
a     2    0    1
b     5    3    4
c     8    6    7

In [19]:
s = pd.Series(np.arange(0, 2.5, 0.5),
             index=['a', 'b', 'c', 'd', 'e'])
s

a    0.0
b    0.5
c    1.0
d    1.5
e    2.0
dtype: float64

In [20]:
new_s = s.drop("b")
new_s

a    0.0
c    1.0
d    1.5
e    2.0
dtype: float64

In [21]:
s.drop(["c", "d"])

a    0.0
b    0.5
e    2.0
dtype: float64

In [22]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                  index=["Kate","Tim",
                         "Tom","Alex"],
                  columns=list("ABCD"))
data

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [23]:
data.drop(['Kate', 'Tim'])

       A   B   C   D
Tom    8   9  10  11
Alex  12  13  14  15

In [27]:
data.drop("A", axis=1)

       B   C   D
Kate   1   2   3
Tim    5   6   7
Tom    9  10  11
Alex  13  14  15

In [28]:
data.drop("Kate", axis=0)

       A   B   C   D
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [30]:
data.mean(axis="index")

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [31]:
data

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [32]:
data.mean(axis="columns")

Kate     1.5
Tim      5.5
Tom      9.5
Alex    13.5
dtype: float64